Autodesk.Revit.DB.SATExportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SATExportOptions.#ctor(Autodesk.Revit.DB.SATExportOptions)
Constructs a new instance of SATImportOptions as a copy of the export options.
option:
The options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.SATExportOptions.#ctor
Constructs a new instance of SATImportOptions with default values of all properties.

Autodesk.Revit.DB.SATExportOptions
The export options used by exporting SAT format file. So far, there is no option in it.